demo-output/website/dafoam/f6a_epistemic_band/r4_band_tightening_hump/oneC_delta0.25/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

#include "../caseDef"
#include "inletOutletFields/k_inlet"

internalField   uniform $kRef;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           $k_inlet;
    }

    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    sides
    {
        type            empty;
    }
    
    top
    {
        type            symmetry;
    }

}

// ************************************************************************* //
