demo-output/website/dafoam/f6a_epistemic_band/r4_band_tightening_hump/oneC_delta0.25/system/wallValues
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

#include "../fieldDef"

fields       $wallValuesFields;

surfaceFormat raw;

surfaces
(


    wallValues
    {
        type        patch;
        patches     (bottom);

    }
);

// ************************************************************************* //
